{
   "crossroad1":[
       "You've arrived at a crossroads in your journey.\nYour car's engine hums in the background.\nDisplayed before you is an intricate series of\nintertwining woods and ever-shifting grass.", 
       "The woods themselves feel alive,\nswaying gently as a gentle breeze passes overhead.\nDying leaves fall from their branches.", 
       "The trail you have been following for some\ntime stops short in front of a singular tree.\nIt looks down on you.",
       "You look up at the tree.\nIts branches lack the leaves that its nearby\nsiblings tout. A small shoe, no larger than an infant's,\nhangs by its laces from one of the tree's limbs.",
       "Upon closer inspection, you find that with\nvery little effort, you can grab the shoe\nif you so wish.",
       "*Please drag the shoe into the backpack.*"
   ],
    "pickUpShoe":[
       "You grab the shoe. It's worn from use.\nMud and dirt cover the laces.\nYou're not quite sure why you grabbed it.",
       "Best not to dwell on that decision,\nlook on the bright side; you have a shoe now.",
       "*You may drag certain items into your bag\nwhen you are searching in an area.\nThere is no pressure on collecting anything.\nPlease do whatever you feel like.*",
       "Feel free to depart when you are ready."
    ],
    "crossroad1_continue":[
       "The tree, no longer an interesting obstacle\nin your journey, is blotted out of your\nmind as you continue forward, moving past\nthe finished trail and into the forest proper.",
       "The crunch of branches underfoot radiates\nthrough the woods, the distant sound\nof a woodpecker returning its call.",
       "In the distance, you see it.\nYour destination.\nYour goal.",
       "It stands tall, taller than you imagined.\nOf course, in reality most towers are larger\nthan you envision them to be, sturdier too.\nIt breaks the cloud-line.",
       "In fact, now that you've taken note of it, you\nfind that it is the only object to pierce the\ndense canopy of the woods. Additionally,\nyou can't even see the top.",
       "As your gaze falls back to the forest,\nyou notice that a fog has begun overtaking the\nground layer. It appears that soon, this tower\nwill be your only guide.",
       "Best to keep that in mind.\nYou continue forward, into the fog."
    ],
    "crossroad1_leave":[
       "You've left the forest.\nPerhaps it was for the best.",
       "FIN.\n\nContinue to go back to Menu."
    ],
    "crossroad1_fog":[
       "An immediate sense of regret washes over you.\nAs you turn to retrace your steps, you find\nthat the woods have already shifted behind you.\nThe tower, however, remains stationary."
    ],
    "pocket":[
       "You dig through your pockets, looking for an\nindescript object. You aren't quite sure why.",
       "You dumped everything you owned before coming here,\nremember?"
    ],
    "pocket_yes":[
       "It's a hard thing to forget, isn't it?"
    ],
    "pocket_no":[
       "Oh. Well, you did. And now you know."
    ],
    "grotto":[
      "You continue forth, not allowing empty pockets\nto hinder your travel. One tree, its wood black\nand sickly, stands as the centerpiece in a small grotto. ",
      "Its roots, which reach out some thirty feet or\nso in all directions, form a perfect circle around the trunk.",
      "This clearing, allowing you a view of the sky,\nsits in silence. The whistling of wind shakes\nthe leaves of the old wood.",
      "You are alone."
    ]

}