{
   "crossroad":[
       "You've arrived at a crossroads in your journey.\nYour car's engine hums in the background.\nDisplayed before you is an intricate series of\nintertwining woods and ever-shifting grass.", 
       "The woods themselves feel alive,\nswaying gently as a gentle breeze passes overhead.\nDying leaves fall from their branches.", 
       "The trail you have been following for some\ntime stops short in front of a singular tree.\nIt looks down on you.",
       "You look up at the tree.\nIts branches lack the leaves that its nearby\nsiblings tout. A small shoe, no larger than an infant's,\nhangs by its laces from one of the tree's limbs.",
       "Upon closer inspection, you find that with\nvery little effort, you can grab the shoe\nif you so wish.",
       "*Please drag the shoe into the backpack.*"
   ],
    "pickUpShoe":[
       "You grab the shoe. It's worn from use.\nMud and dirt cover the laces.\nYou're not quite sure why you grabbed it.",
       "Best not to dwell on that decision,\nlook on the bright side; you have a shoe now.",
       "*You may drag certain items into your bag\nwhen you are searching in an area.\nThere is no pressure on collecting anything.\nPlease do whatever you feel like.*",
       "Feel free to depart when you are ready."
    ],
    "crossroad_continue":[
       "The tree, no longer an interesting obstacle\nin your journey, is blotted out of your\nmind as you continue forward, moving past\nthe finished trail and into the forest proper.",
       "The crunch of branches underfoot radiates\nthrough the woods, the distant sound\nof a woodpecker returning its call.",
       "In the distance, you see it.\nYour destination.\nYour goal.",
       "It stands tall, taller than you imagined.\nOf course, in reality most towers are larger\nthan you envision them to be, sturdier too.\nIt breaks the cloud-line.",
       "In fact, now that you've taken note of it, you\nfind that it is the only object to pierce the\ndense canopy of the woods. Additionally,\nyou can't even see the top.",
       "As your gaze falls back to the forest,\nyou notice that a fog has begun overtaking the\nground layer.",
       "It appears that soon, this tower\nwill be your only guide.\nBest to keep that in mind.",
       "Last chance to decide where to go now."
    ],
    "crossroad_leave":[
       "You've left the forest.\nPerhaps it was for the best.",
       "FIN - I'm a coward.\n\nContinue to go back to Menu."
    ],
    "crossroad_fog":[
      "You have trekked into the fog.",
      "An immediate sense of regret washes over you.\nAs you turn to retrace your steps, you find\nthat the woods have already shifted behind you.",
      "The tower, however, remains stationary.\nYou dig through your pockets.\n*Please check your inventory.*"
   ],
   "pocket":[
      "You try to look for an indescript object.\nYou aren't quite sure why.",
      "You dumped everything you owned before\ncoming here, remember?"
   ],
   "pocket_yes":[
      "It's a hard thing to forget, isn't it?",
      "You continue forth, not allowing empty pockets\nto hinder your travel."
   ],
   "pocket_no":[
      "Oh. Well, you did. And now you know.",
      "You continue forth, not allowing empty pockets\nto hinder your travel."
   ],
   "grotto":[
     "One tree, its wood blackand sickly, stands as\nthe centerpiece in a small grotto. ",
     "Its roots, which reach out some thirty feet\nor so in all directions, form a perfect circle\naround the trunk.",
     "This clearing, allowing you a view of the sky,\nsits in silence. The whistling of wind shakes\nthe leaves of the old wood.",
     "You are alone."
   ],
   "grotto_investigate":[
      "The tree stands unmoving before you.\nSlowly and methodically carving a path to the\ndirt below, amber resin leaks from the old wood.",
      "The air is silent around you, the fog kept\non the outskirts of this small grotto.",
      "What do you want to do?"
   ],
   "grotto_wifeFinally":[
     "\"Finally. what?\" Your wife responds.",
     "You're sitting on your couch, the leather old\nand cracking. Your wife sits next to you,\nher gaze undecipherable.",
     "She's waiting for a response."
   ],
   "grotto_wifeSilence":[
      "\"Listen, if you don't feel like talking, that's fine.\nJust please don't ignore me.\" She continues,\na hint of annoyance in her voice.",
      "She's doing her best to hide it, but you know\nher well enough. She's dealt with this before.",
      "How are you going to respond?"
   ],
   "grotto_apologeticWife":[
      "She stares at you for a moment before\nnodding her head.",
      "\"We were talking about Adalade. You said\nyou finally got her into that preschool, right?\nThe one next to the Dennys?\"",
      "What do you want to say?"
   ],
   "grotto_lieToWife":[
      "\"Oh. Really?\"\nShe seems surprised.",
      "\"Do you think you can take her then?\nOn your way to work?\""
   ],
   "grotto_wifeNoPreschool":[
      "She nods in understanding. You know the look.\nYou've seen it before.",
      "The hint of disappointment.\nThe attempt to hide it. \nIt's routine.",
      "How will you respond?"
   ],
   "backToGrotto":[
      "A strong gust of wind forces you back to\nthe grotto. A chill runs through your spin.",
      "You are alone again."     
   ],
   "grotto_holyShit":[
      "\"Holy fucking shit. You did not\nleave our daughter at school again.\"\nA deafening silence follows her words.",
      "Then, the shuffling of feet, dangling of keys,\nand the closing of a front door\nall follow in quick succession.",
      "You stand there. Motionless."
   ],
   "grotto_yellAtWife":[
      "You yell as she leaves. Suddenly out of breath,\nyou find yourself heaving for air.",
      "Anger builds within you."
   ],
   "grotto_breathingExercise":[
      "You take a breath.\nYou remember how to do this, right?",
      "It's the box breathing method.\nYou know, 4-4-4-4?",
      "You spend sixteen seconds breathing.\nYes, exactly sixteen."
   ],
   "grotto_punchTree":[
      "You punch the tree.\nIt deserved it probably.\nYour hand stings with disapproval.",
      "Anger fills your body. Your time in the\nforest hasn't brought you the peace\nof mind you had hoped it would."
   ],
   "grotto_sit":[
      "It dawns on you that you're wasting\nyour time here.",
      "\"Honey, did you pick up Adalade from school?\"\nYour wife calls from the living room.",
      "You didn't. She got out of school two hours\nago. You've been sitting on this couch since\nyou woke up.",
      "How are you going to respond?"
   ],
   "grotto_leave":[
      "You leave the grotto in the past, turning to\ncontnue your pursuit of the distant tower,\nits spires reaching far into the gray\novercast above.",
      "The sounds of the fauna echo throughout\nthe region.\n\nTo be continued...",
      "*Continue to return back to menu*"
   ],
   "grotto_leavePartOne":[
      "You turn to leave from the grotto, only to\nsee an unrecognizable assortment of trees\nand forest behind you.",
      "You are totally and completely lost."
   ],
   "grotto_leavePartTwo":[
      "A sudden and complete sense of dread and\nparanoia overcome you as you return to\nthe grotto.",
      "For some reason, you feel as though you just\ndanced with death."
   ],
   "grotto_end":[
      "Deciding to throw your responbilities and\nobligations thrown to the wind, you live out\nthe rest of your days in the forest.",
      "FIN - I tried, but what else can change me?\n\n\n*Continue to go back to Menu*"
   ],
   "bridge_start":[
      "The sound of running water begins to fill\nyour ears as you spot a small river\ncutting the forest in two.",
      "A bridge connects the ten foot gap between\nyou and the land opposite the river.",
      "It's wooden floorboards sway and rattle\ngently with the wind.",
      "This bridge hasn't been maintained in some\ntime. Droplets of water drip from its wood,\nas though it has just been misted.",
      "It beckons you to cross the chasm.\nAs you peer below, over the edge, you\nquickly note the distance to be fifteen\nfeet, give or take a foot.",
      "It would not be a pleasant fall.\n\nYou may want to inspect the bridge\nbefore continue ahead.",
      "What do you want to do?"
   ],
   "bridge_inspectBridge":[
      "You inspect the bridge from a safe distance.\nWhile it can most certainly hold your weight,\nit wouldn't be for long.",
      "As it turns out, abandoned bridges lose\ntheir integrity.",
      "What else do you want to do?"
   ],
   "bridge_cussAtWorld":[
      "Your wife stands, staring at you.\nUnflinching.\nHer gaze stern and focused.",
      "You are in your garage,\nsunlight flooding in from the open door that\nallows a view into the empty street.",
      "\"Is that all?\" She asks you.\nThe tone is piercing.",
      "How do you want to respond?"
   ],
   "bridge_imSorry":[
      "Her expression recoils slightly, caught\noff-guard by your answer.",
      "\"Well in that case, I'm done here. You need to\nfigure your shit out, because you can't just\nbe cussing at me like that.\"",
      "\"I deserve better. I'm here for you, but\nI'm not here to be your punching bag.\"",
      "She sighs. This is a conversation she's had\nmany times over.",
      "\"You know what? I... Just. Nevermind.\nFigure your shit out, okay?\" She asks,\nturning and leaving the garage.",
      "Your car sits expectantly in the room."
   ],
   "bridge_confirm":[
      "...",
      "....",
      "Are you sure?"
   ],
   "bridge_argueYes":[
      "The moment you begin to speak, your wife\ninterrupts you.",
      "\"No? What the fuck do you mean no? Do you\nhonestly think I'm just going to fucking sit\nhere while you yell at me in my own garage?",
      "\"Do you think I have the TIME to do that?\nFor YOU of all people? You've got to be joke,\nright?\" She laughs.",
      "\"Oh, this is rich. I'll tell you what, you can tell\nyour friends you got to stroke your little ego\none last time before I left you.\"",
      "\"I'm sure that'll fix the gaping hole in\nyour heart.\" The door slams as she leaves.",
      "For the first time, you are alone.",
      "Your car sits expectantly in the room."
   ],
   "bridge_sayNothing":[
      "\"You can't keep doing this.\"\n She sighs.",
      "\"You can't just explode and then stay silent\nas though that solves the problem. I do not\ndeserve this.\"",
      "She speaks, \"Get your shit together, alright?\nI said I'd be there for you, but I'm not here\nto be your punching bag.",
      "\"Not talking to me doesn't solve the problem.\nBottling up doesn't solve the problem.\"",
      "A deep exhale escapes from her nose as\nshe turns to leave.",
      "\"And Adalade doesn't deserve this either.\nFigure your shit out.\"",
      "Your car sits expectantly in the room."
   ],
   "bridge_takeCar":[
      "Without hesitation, you enter your vehicle,\nslamming the reverse as you exit your home.",
      "The highway offers little respite as you\npass person after person, their cars\nbecoming blurs on the wayside.",
      "An exit, one that, to your knowledge, has just\nfinished construction, appears up ahead.",
      "You barrel your vehicle into the exit.\nNotably, you are the only one to take it.",
      "The familiar stretch of highway is soon\nexchanged for large redwoods in the distance,\na single large tower catching your eye.\nIt lies straight ahead of you."
   ],
   "bridge_crossing":[
      "You approach the bridge, placing your hands\non its posts, each of which are staked deep\ninto the earth.",
      "It beckons you to cross.",
      "You step forward, the wooden floorboards\ncreaking beneath you. The bridge holds your\nweight. You allow yourself a breath of relief.",
      "A gust of wind forces you to steel your grip.\nYou feel your hands tighten around the rope\nhandles of the bridge as it rattles with\nthe breeze.",
      "What are you going to do?"
   ],
   "bridge_waitOutTheWind":[
      "The air buffets the old construction, forcing\nyou to tighten your grip to the rope handles\neven more, the wooden floorboards swinging\nand drifting with the wind.",
      "After some time, the wind recedes again.\nThe insides of your hands, etched with the\nmarkings of the rope, sting slightly from the\ntightness of your grip.",
      "Perhaps it would've been best to go across\nbefore the wind picked up. The tower stands\nin the distance ahead of you.",
      "Your hands clammy and antsy, the cold air\nforcing a sniffle.",
      "Despite it all, it appears your journey\nis nearing an end."
   ],
   "bridge_continueFoward":[
      "You take your steps slowly, careful to not\nstep on any portions of clearly rotted wood.",
      "The bridge rattles as you step, some of the\nfloorboards shifting slightly beneath your weight.",
      "Before long, you have found yourself on the\nother side of the river, the forest covered in\nfog behind you.",
      "A breeze sways the treetops. The soft sound\nof leaves brushing against leaves fills the air.",
      "The tower, ever so close, stands fortified\nin the ground. It appears your journey is\nnearing an end.",
      "You want to..."
   ],
   "bridge_runAcrossBridge":[
      "You plant your feet as your sprint across\nthe bridge, the floorboards cracking and flying\ninto the water beneath you as you do.",
      "The bridge cries as it creaks, practically\nunrecognizable from its previous state. It is\nno longer crossable for any future explorers.",
      "You feel your body fume with emotion, almost\noverwhelmingly so. The forest, obstacle after\nobstacle, is still no match for your brute force.",
      "As you take a moment to collect yourself,\nyou spot the tower once more. It stands tall,\nmuch closer than previously though.",
      "It appears your journey is nearing an end."
   ],
   "bridge_calm":[
      "You feel calmer. The tightness in your chest\nmellows slightly as you take a breath.",
      "The forest offers a moment of brevity and\npeace. The air is cold against your nose,\nforcing a sniffle.",
      "A squirrel passing underfoot catches your\nattention before disappearing high into one\nof the trees. You are alone, but at least\nthere's company.",
      "You have finally reached the tower."
   ],
   "tower_base":[
      "You stare up at the tower, yet even as you squint\nyour eyes you are unable to see the top.",
      "A small doorway stands in between you and\nthe stairs that are surely inside.",
      "The tower itself, made of mossy stone and overun\nwith foliage, appears weary with age."
   ],
   "goodEnding":[
      "You begin the ascent of the spiral staircase,\nsmall windows adorning the its sides, allowing\nyou glimpses into the outside world as\nyou climb.",
      "Your legs are heavy, weary from the journey.\nThe fog seems to recede the higher you climb,\nthe forest becoming more and more visible\nas you trek further up the tower",
      "You climb for what seems like ages, soon\nfinding that the top of this tower has long\nsince been destroyed.",
      "Or perhaps, it was never completed.",
      "It stands half-constructed. As you peer below,\nyou find that the ground is a great distance\nbelow you.",
      "You stand at the half-constructed peak of\nthis tower, gazing at the forest and\nits surroundings.",
      "A familiar grotto, noticeable by the forest\nclearing, sways below you. The sounds of\nthe fauna appear to be dying down as the sun\nwanes below the horizon in the distance.",
      "A single lighthouse, sitting on a rock\nformation just past the coast, has begun\nto spin its light in a familiar rhythm.",
      "You feel at ease as you stare at this view.\nThe forest sways in delight.",
      "The sun begins to dip over the horizon."
   ],
   "badEnding":[
      "You begin the ascent of the spiral staircase,\nsmall windows adorning the its sides,\nallowing you glimpses into the outside world as you climb.",
      "Your legs are heavy, weary from the journey.\nThe fog outside seems to completely engulf the base of the tower.",
      "In other words, below you is a sea of fog,\nthe gray of the clouds staionary above you.",
      "You climb for what seems like ages, soon finding that the top of this\ntower has long since been destroyed.",
      "Or perhaps, it was never completed.",
      "It stands half-constructed. As you peer below,\nyou find that the ground is a great distance below you.",
      "Looking up, the forest and its surroundings remain drenched in fog.",
      "The coast gently waves in the distance,\na singular lighthouse planting on a rock formation in the water\nspins its focused light in a familiar rhythm.",
      "Ever so faintly, you hear the sound of waves crashing on rock.",
      "he forest offers you this view,\nhowever, a waning sun in the distance,\nducking under the horizon, indicates that it is not to last."
   ]
}
